//text in top page
const T_text1 = `この度はご参加いただきありがとうございます。¥n
本調査は工学院大学の研究室が実施するお金の分配に関するアンケート調査です。¥n
アンケートの概要やその流れ、注意事項等の事前説明はランサーズ上にある、本調査の募集ページに記載しております。¥n`;

const T_text2 = `ご質問や不明点がございましたら、工学院大学応用経済分析研究室の¥n
齋野(j319138@ns.kogakuin.ac.jp)までご連絡ください。¥n
この調査研究やその手順、リスクや利点についてご質問や苦情がある場合は、¥n
研究室担当教員矢﨑(yasaki@cc.kogakuin.ac.jp)までご連絡ください。¥n
独立した連絡先 : この研究の実施方法に懸念やご質問がある場合は、工学院大学研究支援室(〒192-0015 東京都八王子市中野町2665-1)までご連絡ください。¥n
`;

// text in briefing page
const B_text1 = `【本実験の概要】¥n
本実験ではパソコンの画面上に表示される"お金の分配"に関する質問について「どのくらいを相手に渡すか」、
もしくは「提示された金額を受け入れるか」を皆様の直感に従い、答えていただくものです。¥n
この実験の所要時間はおよそ5分程度となっております。¥n
回答は任意であり、実験途中で参加を中断することも可能なため、回答の継続が難しい場合などはブラウザのタブを直接閉じ、実験を中断することができます。¥n
基本的には回答は1人につき1度までですが、やむを得ない事情で回答を中断された場合は再度回答していただいても構いません。¥n
回答の途中経過は保存されませんので、中断された際は最初から実験を始めてください。`;

const B_text2 = `【データ提供の可否について】¥n
実験終了後の事後説明でデータ提供の可否について確認させていただきます。¥n
その際にデータ提供不可の申し出をされたり、参加を中断された場合は、送信されたデータは削除され分析には用いられません。¥n
なお，研究実施者側では回答者が特定できない形でデータを取得しておりますので，アンケート回答終了時にデータ提供に同意いただいた場合，
その後の撤回は出来ません。あらかじめご了承ください。`;

const B_text3 = `【謝礼のお渡し方法等について】¥n
本実験に最後まで参加し、データ提供に同意していただいた方に、謝礼として30円をお渡しいたします。¥n
恐れ入りますが、実験への参加を中止した場合やデータ提供に同意されなかった場合、
こちらの指示とは異なった回答をされた場合などは、謝礼をお渡しできません。ご承知いただければ幸いです。¥n
データ提供等の事後説明に同意していただいた方には確認番号を提示いたします。¥n
その番号をランサーズの本実験募集ページの下にある空欄に入力していただければ、ランサーズ社を通して謝礼をお支払いさせていただきます。¥n
実験にお答えいただいた方でも本番号がなければ謝礼をお渡しすることができません。必ずお控えをお取りいただきますようお願いいたします。`;

const B_text4 = `【データの利用方法について】¥n
今回取得したデータは研究および教育目的で利用され、統計的に解析された結果は論文や学会発表または大学の講義等様々な形で公表される場合があります。¥n
さらにアンケートへの回答そのものも研究報告および成果の一部として2次利用可能な状態で公開(オープンデータ化)される可能性があります。¥n
なお研究実施者は、今回の調査において回答者の皆様の個人特定が可能となるデータ(名前や電話番号など)を取得しません。¥n
したがって、研究成果の報告やデータ公開に際しても匿名性は保たれます。¥n
また、アンケートに回答を入力し、次のページへ移動した時点で、お答えいただいたデータは送信されます。¥n
ですが実験を途中で中断された場合や事後説明でデータ提供不可の申し出をされた際、送信されたデータは削除されます。`;

const B_text5 = `【実験の流れ】¥n
実験の流れとしましては¥n
次ページでパスコードを使ってログイン → 各種アンケートに答える → 確認番号のページの入力¥n
となっております。¥n
詳しい流れは右上の「実験の流れ」ボタンからご確認ください。`;

const B_text6 = `調査は任意であり、協力しないことによって回答者が不利益を被ることはありません。¥n
下のボタンを押し、実験のログイン画面へお進みください。`;

export {
  T_text1,
  T_text2,
  B_text1,
  B_text2,
  B_text3,
  B_text4,
  B_text5,
  B_text6
};
